## SQL at Scale with Spark SQL

Welcome to the SQL mini project. For this project, you will use the Domino Data Lab Platform and work through a series of exercises using Spark SQL. The dataset size may not be too big but the intent here is to familiarize yourself with the Spark SQL interface which scales easily to huge datasets, without you having to worry about changing your SQL queries. 

The data you need is present in the mini-project folder in the form of three CSV files. You need to make sure that these datasets are uploaded and present in the same directory as this notebook file, since we will be importing these files in Spark and create the following tables under the __`country_club`__ database using Spark SQL.

1. The __`bookings`__ table,
2. The __`facilities`__ table, and
3. The __`members`__ table.

You will be uploading these datasets shortly into Spark to understand how to create a database within minutes! Once the database and the tables are populated, you will be focusing on the mini-project questions.

In the mini project, you'll be asked a series of questions. You can solve them using the Domino platform, but for the final deliverable, please download this notebook as an IPython notebook (__`File -> Export -> IPython Notebook`__) and upload it to your GitHub.

# Checking Existence of Spark Environment Variables

Make sure your notebook is loaded using a PySpark Workspace. If you open up a regular Jupyter workspace the following variables might not exist

In [3]:
spark

In [4]:
sqlContext

### Run the following if you failed to open a notebook in the PySpark Workspace

This will work assuming you are using Spark in the cloud on domino or you might need to configure with your own spark instance if you are working offline

In [6]:
if 'sc' not in locals():
    from pyspark.context import SparkContext
    from pyspark.sql.context import SQLContext
    from pyspark.sql.session import SparkSession
    
    sc = SparkContext()
    sqlContext = SQLContext(sc)
    spark = SparkSession(sc)

# Create a utility function to run SQL commands

Instead of typing the same python functions repeatedly, we build a small function where you can just pass your query to get results.

- Remember we are using Spark SQL in PySpark
- We can't run multiple SQL statements in one go (no semi-colon ';' separated SQL statements)
- We can run multi-line SQL queries (but still has to be a single statement)

In [8]:
def run_sql(statement):
    try:
        result = sqlContext.sql(statement)
    except Exception as e:
        print(e.desc, '\n', e.stackTrace)
        return
    return result

# Creating the Database

We will first create our database in which we will be creating our three tables of interest

In [10]:
run_sql('drop database if exists country_club cascade')
run_sql('create database country_club')
dbs = run_sql('show databases')
dbs.toPandas()

# Creating the Tables

In this section, we will be creating the three tables of interest and populate them with the data from the CSV files already available to you.

To get started, first make sure you have already uploaded the three CSV files and they are present in the same directory as the notebook.

Once you have done this, please remember to execute the following code to build the dataframes which will be saved as tables in our database

In [12]:
# File location and type
file_location_bookings = "/FileStore/tables/Bookings.csv"
file_location_facilities = "/FileStore/tables/Facilities.csv"
file_location_members = "/FileStore/tables/Members.csv"
#file_location_bookings = "./Bookings.csv"
#file_location_facilities = "./Facilities.csv"
#file_location_members = "./Members.csv"

file_type = "csv"

# CSV options
infer_schema = "true"
first_row_is_header = "true"
delimiter = ","

# The applied options are for CSV files. For other file types, these will be ignored.
bookings_df = (spark.read.format(file_type) 
                    .option("inferSchema", infer_schema) 
                    .option("header", first_row_is_header) 
                    .option("sep", delimiter) 
                    .load(file_location_bookings))

facilities_df = (spark.read.format(file_type) 
                      .option("inferSchema", infer_schema) 
                      .option("header", first_row_is_header) 
                      .option("sep", delimiter) 
                      .load(file_location_facilities))

members_df = (spark.read.format(file_type) 
                      .option("inferSchema", infer_schema) 
                      .option("header", first_row_is_header) 
                      .option("sep", delimiter) 
                      .load(file_location_members))

### Viewing the dataframe schemas

We can take a look at the schemas of our potential tables to be written to our database soon

In [14]:
print('Bookings Schema')
bookings_df.printSchema()
print('Facilities Schema')
facilities_df.printSchema()
print('Members Schema')
members_df.printSchema()

# Create permanent tables
We will be creating three permanent tables here in our __`country_club`__ database as we discussed previously with the following code

In [16]:
permanent_table_name_bookings = "country_club.Bookings"
bookings_df.write.format("parquet").saveAsTable(permanent_table_name_bookings)

permanent_table_name_facilities = "country_club.Facilities"
facilities_df.write.format("parquet").saveAsTable(permanent_table_name_facilities)

permanent_table_name_members = "country_club.Members"
members_df.write.format("parquet").saveAsTable(permanent_table_name_members)

### Refresh tables and check them

In [18]:
run_sql('use country_club')
run_sql('REFRESH table bookings')
run_sql('REFRESH table facilities')
run_sql('REFRESH table members')
tbls = run_sql('show tables')
tbls.toPandas()

# Test a sample SQL query

__Note:__ You can use multi-line SQL queries (but still a single statement) as follows

In [20]:
result = run_sql('''
                    SELECT * 
                    FROM bookings 
                    LIMIT 3
                 ''')
result.toPandas()

# Your Turn: Solve the following questions with Spark SQL

- Make use of the `run_sql(...)` function as seen in the previous example
- You can write multi-line SQL queries but it has to be a single statement (no use of semi-colons ';')
- Make use of the `toPandas()` function as depicted in the previous example to display the query results

#### Q1: Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do.

In [23]:
result = run_sql('''
                 SELECT name
                 FROM facilities
                 WHERE membercost != 0  
                 ''')
result.toPandas()

####  Q2: How many facilities do not charge a fee to members?

In [25]:
result = run_sql('''
                 SELECT COUNT(name)
                 FROM facilities
                 WHERE membercost = 0  
                 ''')
result.toPandas()

#### Q3: How can you produce a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost? 
#### Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

In [27]:
result = run_sql('''
                 SELECT facid, name, membercost, monthlymaintenance
                 FROM facilities
                 WHERE membercost < (monthlymaintenance * 0.2) AND (membercost > 0)  
                ''')
result.toPandas()

#### Q4: How can you retrieve the details of facilities with ID 1 and 5? Write the query without using the OR operator.

In [29]:
result = run_sql('''
                 SELECT *
                 FROM facilities
                 WHERE facid = 1
                 UNION
                 SELECT *
                 FROM facilities
                 WHERE facid = 5   
                ''')
result.toPandas()

#### Q5: How can you produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100? 
#### Return the name and monthly maintenance of the facilities in question.

In [31]:
result = run_sql('''
                 SELECT f.name, f.monthlymaintenance,
                 CASE
                 WHEN monthlymaintenance > 100 THEN 'expensive'
                 WHEN monthlymaintenance <= 100 THEN 'cheap'
                 END AS label
                 FROM facilities AS f  
                 ''')
result.toPandas()

#### Q6: You'd like to get the first and last name of the last member(s) who signed up. Do not use the LIMIT clause for your solution.

In [33]:
result = run_sql('''
                 SELECT * FROM
                 (SELECT firstname, surname, ROW_NUMBER() OVER (ORDER BY joindate DESC) AS row_number
                 FROM Members)
                 WHERE row_number < 4   
                 ''')
result.toPandas()

####  Q7: How can you produce a list of all members who have used a tennis court?
- Include in your output the name of the court, and the name of the member formatted as a single column. 
- Ensure no duplicate data
- Also order by the member name.

In [35]:
result = run_sql('''
                  SELECT DISTINCT concat(members.firstname,' ', members.surname) AS member_name, facilities.name
                  FROM ((bookings
                  INNER JOIN facilities ON facilities.facid = bookings.facid)
                  INNER JOIN members ON bookings.memid = members.memid)
                  WHERE facilities.name LIKE 'Tennis Court%' 
                  ORDER BY member_name ASC  
                 ''')
result.toPandas()

#### Q8: How can you produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30? 

- Remember that guests have different costs to members (the listed costs are per half-hour 'slot')
- The guest user's ID is always 0. 

#### Include in your output the name of the facility, the name of the member formatted as a single column, and the cost.

- Order by descending cost, and do not use any subqueries.

In [37]:
result = run_sql('''
                  SELECT f.name AS facility_name, concat(members.firstname,' ', members.surname) AS member_name, f.membercost*b.slots AS cost
                  FROM ((bookings AS b
                  INNER JOIN facilities AS f ON f.facid = b.facid)
                  INNER JOIN members ON b.memid = members.memid)
                  WHERE (DATE(b.starttime) = '2012-09-14') AND (b.memid !=0) AND (f.membercost*b.slots>30)
                  UNION ALL
                  SELECT f.name AS facility_name, concat(members.firstname,' ', members.surname) AS member_name, f.guestcost*b.slots AS cost
                  FROM ((bookings AS b
                  INNER JOIN facilities AS f ON f.facid = b.facid)
                  INNER JOIN members ON b.memid = members.memid)
                  WHERE (DATE(b.starttime) = '2012-09-14') AND (b.memid ==0) AND (f.guestcost*b.slots>30)
                  ORDER BY cost DESC  
                 ''')
result.toPandas()

#### Q9: This time, produce the same result as in Q8, but using a subquery.

In [39]:
result = run_sql('''
                  SELECT * FROM
                  (SELECT f.name AS facility_name, concat(m.firstname,' ', m.surname) AS member_name,
                  CASE
                  WHEN b.memid == 0 THEN f.guestcost*b.slots
                  ELSE f.membercost*b.slots
                  END AS cost
                  FROM ((bookings AS b
                  INNER JOIN facilities AS f ON f.facid = b.facid)
                  INNER JOIN members AS m ON b.memid = m.memid)
                  WHERE (DATE(b.starttime) = '2012-09-14'))
                  WHERE cost > 30
                  ORDER BY cost DESC   
                 ''')
result.toPandas()

#### Q10: Produce a list of facilities with a total revenue less than 1000.
- The output should have facility name and total revenue, sorted by revenue. 
- Remember that there's a different cost for guests and members!

In [41]:
result = run_sql('''
                 SELECT * FROM
                 (SELECT f.name, b.facid,
                 SUM(CASE
                 WHEN b.memid == 0 THEN f.guestcost*b.slots
                 ELSE f.membercost*b.slots
                 END) AS revenue
                 FROM facilities as f
                 INNER JOIN bookings as b ON b.facid = f.facid
                 GROUP BY f.name, b.facid
                 ORDER BY revenue DESC)
                 WHERE revenue <1000   
                 ''')
result.toPandas()